product_service/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "New Product"], ["description", "Great product"], ["price", "29.99"], ["created_at", "2023-11-24 12:39:19.956299"], ["updated_at", "2023-11-24 12:39:19.956299"]]
---
  def create
    @product = Product.new(product_params.except(:images))
    attach_images if product_params[:images]

    if @product.save

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 22]]
---
  def destroy
    if @product.destroy